app/controllers/api/v1/urls_controller.rb

INSERT INTO "urls" ("url", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["url", "http://google.com.vn"], ["created_at", "2022-08-19 15:52:32.420118"], ["updated_at", "2022-08-19 15:52:32.420118"]]
---
      def encode
        @url = Url.create!(url: params[:url])

SELECT "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
      def decode
        raise ActionError.new("Couldn't find Url without a key") if params[:key].blank?

        decoded = HASHIDS.decode(params[:key])

        raise ActionError.new('Url is invalid') if decoded.blank?

        @url = Url.find_by(id: decoded[0])